{
    "light bulb": "The first attempts to create light using electricity date back to 1802. It should take until the 1870s until the invention finally became economically viable. Even though these earlylight bulbs were far from reliable, they offered many advantages over previous light sources. They did not smoke or stink and most importantly were much less prone to fires.\nLight bulbs consist of tungsten filament, connected to two lead-in wires. These wires nare connected to a base or socket. The socket provides the electricity inlet as well as the mechanism to hold them in place. The base is usually shaped like a screw. The filament is protected by a glass bulb filled with protective gas or a vacuum. The protective gas prevents the filament from burning out too fast and especially keeps the glass from turning black.",
    "halogen": "The Halogen lamp is a sort of incandescent lamp with a small amount of some halogen gas, most commonly iodine or bromine, as an atmosphere in a quartz or aluminosilicate glass bulb. In ordinary incandescent lamps, tungsten evaporates under the influence of the heat and deposits on the inner surface of the glass bulb darkening its surface. Major characteristic of the halogen lamp is relation between tungsten and halogen gas in the glass bulb (so-called halogen cycle). When tungsten evaporates, it reacts with halogen forming the halide, which does not deposit on the glass. That is why it is made from quartz or aluminosilicate glass.\n The first lamp to use halogen gas (chlorine) was patented in 1882 but the first commercial halogen lamp that used iodine as a halogen gas was patented in 1959 by General Electric. It was developed by Elmer Fridrich and Emmet Wiley who worked at General Electric, in 1955.",
    "led": "The Light-emitting diode (LED) is an electric component that emits light when connected to direct current. In 1907, British experimenter in Marconi labs Henry Joseph Round noticed for the first time that when a potential of 10 volts is applied to carborundum (silicon carbide) crystal, it emits yellowish light. However, first to investigate it and to propose a working theory was Oleg Vladimirovich Losev from Russia in 1927.\n Initially light-emitting diodes were very expensive, some even costing as much as 200€ per piece. Because of that, they were used as indicators only in highly professional laboratory equipment. Fairchild Semiconductors succeeded in 1970s to reduce cost of individual LED to 5 cents by using planar process in production of semiconductor chips for light emitting diodes."
}